var group1 = {
	"2. Філософія лек."	: "професор Петрушенко В.Л. \n I н.к. 218, лекція",
	"3. Філософія прак.": "професор Петрушенко В.Л. \n IV н.к. 327, прак. ",
	"3. Операційні системи прак.": "доцент Чирун Л.В. \n XXIX н.к. 303, прак. ",
	"4. Фізичне виховання, частина 3":"ХЗ ваще",

	"1. Теорія ймовірності та математична статистика лек.":"професор ІлькІв В.С. \n I н.к. 218, лекція",
	"1. Операційні системи лек.":"доцент Яковина В.С. \n I н.к. 218, лекція ",
	"2. Англійська мова (за професійним спрямуванням)":"асистент Шийка Ю.І. \n IV н.к. 123а, прак.",
	
	"2. Операційні Системи лек.":"доцент Яковина В.С. \n I н.к. 218, лекція",
	"3. Операційні Системи лаб.":"доцент Чирун Л.В. \n V н.к. 808, лаб. ",
	"4. Англійська мова (за професійним спрямуванням)":"асистент Шийка Ю.І.\nкаф., прак. ",
	"5. Алгоритми і структури даних лаб.":"асистент Крук О.С.\nV н.к. 810а, лаб. ",

	"2. Алгоритми і структури даних лек.":"доцент Коротєєва Т.О.\nI н.к. 217, лекція ",
	"3. Теорія ймовірності та математична статистика прак.":"асистент Мічуда О.Я.\nI н.к. 401, прак.",
	"4. Архітектура комп'ютера лаб.":"асистент Муляк О.Р.\nV н.к. 810г, лаб.",
	
	"1. Архітектура комп'ютера лек.":"доцент Крук О.Г.\nI н.к. 218, лекція ",
	"2. Алгоритми і структури даних прак.":"доцент Коротєєва Т.О.\nV н.к. 809, прак.",
	"2. Архітектура комп'ютера прак.":"доцент Крук О.Г. \n XXIX н.к. 303, прак. "
};

var group2 = {
	"2. Філософія лек.": "професор Петрушенко В.Л. \n I н.к. 218, лекція",
	"3. Філософія прак.": "професор Петрушенко В.Л. \n IV н.к. 327, прак. ",
	"3. Операційні системи прак.": "доцент Чирун Л.В. \n XXIX н.к. 303, прак. ",
	"4. Фізичне виховання, частина 3":"ХЗ ваще",

	"1. Теорія ймовірності та математична статистика лек.":"професор ІлькІв В.С. \n I н.к. 218, лекція",
	"1. Операційні системи лек.":"доцент Яковина В.С. \n I н.к. 218, лекція ",
	"2. Англійська мова (за професійним спрямуванням)":"асистент Бондарук О.А. \n IV н.к. 123, прак. ",
	"3. Алгоритми і структури даних лаб.":"асистент Крук О.С. \n V н.к. 810а, лаб.",
	
	"1. Операційні Системи лаб.":"доцент Чирун Л.В. \n V н.к. 808, лаб. ",
	"2. Операційні Системи лек.":"доцент Яковина В.С. \n I н.к. 218, лекція",

	"2. Алгоритми і структури даних":"доцент Коротєєва Т.О.\nI н.к. 217, лекція ",
	"3. Теорія ймовірності та математична статистика":"асистент Мічуда О.Я. \n I н.к. 401, прак.",
	"4. Англійська мова (за професійним спрямуванням)":"асистент Бондарук О.А. \n I н.к. 407, прак. ",
	
	"1. Архітектура комп'ютера лек.":"доцент Крук О.Г.\nI н.к. 218, лекція ",
	"2. Алгоритми і структури даних прак.":"доцент Коротєєва Т.О.\nV н.к. 809, прак.",
	"2. Архітектура комп'ютера прак.":"доцент Крук О.Г. \n XXIX н.к. 303, прак. ",
	"3. Архітектура комп'ютера лаб.":"асистент Муляк О.Р. \n XXVIII н.к. 510, лаб. "
};