group1 = { 
	"2. Філософія лек."	: "професор Петрушенко В.Л. <br> I н.к. 218, лекція",
	"3. Філософія прак.": "професор Петрушенко В.Л. <br> IV н.к. 327, прак. ",
	"3. Операційні системи прак.": "доцент Чирун Л.В. <br> XXIX н.к. 303, прак. ",
	"4. Фізичне виховання, частина 3":"ХЗ ваще",

	"1. Теорія ймовірності та математична статистика лек.":"професор ІлькІв В.С. <br> I н.к. 218, лекція",
	"1. Операційні системи лек.":"доцент Яковина В.С. <br> I н.к. 218, лекція ",
	"2. Англійська мова (за професійним спрямуванням)":"асистент Шийка Ю.І. <br> IV н.к. 123а, прак.",
	
	"2. Операційні Системи лек.":"доцент Яковина В.С. <br> I н.к. 218, лекція",
	"3. Операційні Системи лаб.":"доцент Чирун Л.В. <br> V н.к. 808, лаб. ",
	"4. Англійська мова (за професійним спрямуванням)":"асистент Шийка Ю.І.<br>каф., прак. ",
	"5. Алгоритми і структури даних лаб.":"асистент Крук О.С.<br>V н.к. 810а, лаб. ",

	"2. Алгоритми і структури даних лек.":"доцент Коротєєва Т.О.<br>I н.к. 217, лекція ",
	"3. Теорія ймовірності та математична статистика прак.":"асистент Мічуда О.Я.<br>I н.к. 401, прак.",
	"4. Архітектура комп'ютера лаб.":"асистент Муляк О.Р.<br>V н.к. 810г, лаб.",
	
	"1. Архітектура комп'ютера лек.":"доцент Крук О.Г.<br>I н.к. 218, лекція ",
	"2. Алгоритми і структури даних прак.":"доцент Коротєєва Т.О.<br>V н.к. 809, прак.",
	"2. Архітектура комп'ютера прак.":"доцент Крук О.Г. <br> XXIX н.к. 303, прак. "
}

def main():
	mainHTML = open("index.html", "rb").read()

	for each in group1:
		HEADER = each[3:]
		old = '<li onclick="addAlert1(this)">'+each+'</li>'
		new = '<li><table><tr><td><h1>'+each.split(". ")[0]+'&nbsp;&nbsp;&nbsp;</h1></td><td><h3>'+HEADER+'</h3><p>'+group1[each]+'</p></td></tr></table></li>'
		mainHTML.replace(old, new)
		print old
		print new
		print ""

	# open("newIndex.html", "wb").write(mainHTML)

main()